# ZoneNotEnclosed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ZoneFailures..::..ZoneNotEnclosed Property
BuiltInFailures..::..ZoneFailures Class See Also
---
Zone not enclosed totally.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ZoneNotEnclosed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneNotEnclosed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ZoneNotEnclosed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ZoneFailures Class
Autodesk.Revit.DB Namespace